Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: The following qualifiers are accepted:
it_it: Sono accettati i seguenti qualificatori:

source: The last two lines enable CMake's test runner to discover the tests included in the binary, using the GoogleTest CMake module.
it_it: Le ultime due righe consentono al runner dei test di CMake di scoprire i test inclusi nel file binario, utilizzando il modulo GoogleTest di CMake.

source: The parameter multi_argument_matcher must thus be a matcher of type Matcher<std::tuple<A1, ..., An>>, where A1, ..., An are the types of the function arguments.
it_it: Il parametro multi_argument_matcher deve quindi essere un matcher di tipo Matcher<std::tuple<A1, ..., An>>, dove A1, ..., An sono i tipi degli argomenti della funzione.

source: The second step is not strictly needed but it makes the syntax of using the matcher nicer.
it_it: Il secondo passaggio non è strettamente necessario ma rende più gradevole la sintassi dell'utilizzo del matcher.

source: The template parameter T is any mock class, except for another NiceMock, NaggyMock, or StrictMock.
it_it: Il parametro template T è qualsiasi classe mock, ad eccezione di un altra NiceMock, NaggyMock o StrictMock.

source: The test suite name is TestFixtureName.
it_it: Il nome della test suite è TestFixtureName.

source: The "newer expectations override older ones" rule makes writing expectations awkward.
it_it: La regola "Le expectation più nuove sovrascrivono quelle più vecchie" complica la scrittura delle expectation.

source: The "threadsafe" death test style was introduced in order to help mitigate the risks of testing in a possibly multithreaded environment.
it_it: Lo stile "threadsafe" del death test è stato introdotto per mitigare i rischi dei test in un ambiente multithread.

source: The 'typename' is required to satisfy the compiler.
it_it: Il 'typename' è necessario per soddisfare il compilatore.

source: The *description string* is a `string`-typed expression that documents what the matcher does, and is used to generate the failure message when the match fails.
it_it: La *description string* è un'espressione di tipo `string` che documenta ciò che fa il matcher e viene utilizzata per generare il messaggio di errore quando la corrispondenza fallisce.

source: The *first* argument is the name of the test suite, and the *second* argument is the test's name within the test suite.
it_it: Il *primo* argomento è il nome della "test suite" e il *secondo* argomento è il nome del test nella "test suite".

source: The *last* value recorded for a key will be emitted to the [XML output](#generating-an-xml-report) if you specify one.
it_it: L'*ultimo* valore registrato per una chiave verrà emesso nell'[XML output](#generating-an-xml-report) se se ne specifica uno.

source: The 4th parameter accepts a closed list of qualifiers, which affect the generated method:
it_it: Il 4° parametro accetta un elenco chiuso di qualificatori, che riguardano il metodo generato:

source: The --gtest_repeat flag allows you to repeat all (or selected) test methods in a program many times.
it_it: Il flag --gtest_repeat consente di ripetere più volte tutti i metodi di test (o quelli selezionati) in un programma.

source: The ACTION* macros cannot be used inside a function or class.
it_it: Le macro ACTION* non possono essere utilizzate all'interno di una funzione o di una classe.

source: The After clause can be used any number of times on an expectation.
it_it: La clausola After è utilizzabile un numero qualsiasi di volte per ogni expectation.

source: The ExpectationSet object is helpful when the number of prerequisites for an expectation is large or variable, for example:
it_it: L'oggetto ExpectationSet è utile quando il numero di prerequisiti per una expectation è elevato o variabile, ad esempio:

source: The InSequence clause can be used any number of times on an expectation.
it_it: La clausola InSequence è utilizzabile un numero qualsiasi di volte in per ogni expectation.

source: The InitGoogleTest(int* argc, wchar_t** argv) overload can be used in Windows programs compiled in UNICODE mode.
it_it: L'overload InitGoogleTest(int* argc, wchar_t** argv) è utilizzabile nei programmi Windows compilati in modalità UNICODE.

source: The MATCHER* family of macros can be used to define custom matchers easily.
it_it: La famiglia delle macro MATCHER* può essere utilizzata per definire facilmente dei matcher custom.

source: The MATCHER* macros cannot be used inside a function or class.
it_it: Le macro MATCHER* non possono essere utilizzate all'interno di una funzione o di una classe.

source: The ON_CALL() macro allows you to customize your mock's behavior at the method level:
it_it: La macro ON_CALL() consente di personalizzare il comportamento del mock a livello del metodo:

source: The RetiresOnSaturation clause can be used at most once on an expectation and must be the last clause.
it_it: La clausola RetiresOnSaturation può essere utilizzata al massimo una volta su una expectation e deve essere l'ultima clausola.

source: The RetiresOnSaturation clause is only meaningful for expectations with an upper-bounded cardinality.
it_it: La clausola RetiresOnSaturation è significativa solo per le expectation con una cardinalità con un limite superiore.

source: The Return(x) action saves a copy of x when the action is created, and always returns the same value whenever it's executed.
it_it: L'azione Return(x) salva una copia di x quando l'azione viene creata e restituisce sempre lo stesso valore ogni volta che viene eseguita.

source: The SUCCEED assertion is purely documentary and currently doesn't generate any user-visible output.
it_it: L'asserzione SUCCEED è puramente documentaria e attualmente non genera alcun output visibile all'utente.

source: The ScopedTrace constructor has the following form:
it_it: Il costruttore di ScopedTrace ha la seguente forma:

source: The TEST macros handle the vast majority of all use cases, but there are few where runtime registration logic is required.
it_it: Le macro TEST gestiscono la stragrande maggioranza di tutti i casi d'uso, ma ce ne sono alcuni in cui è richiesta la logica di registrazione a runtime.

source: The Times() clause can be omitted.
it_it: La clausola Times() può essere omessa.

source: The Times clause can be used at most once on an expectation.
it_it: La clausola Times può essere utilizzata al massimo una volta su una expectation.

source: The WillByDefault clause must be used exactly once with each ON_CALL statement.
it_it: La clausola WillByDefault deve essere utilizzata esattamente una volta con ciascuna istruzione ON_CALL.

source: The WillOnce clause can be used any number of times on an expectation.
it_it: La clausola WillOnce è utilizzabile un numero qualsiasi di volte per ogni expectation.

source: The WillRepeatedly clause can be used at most once on an expectation.
it_it: La clausola WillRepeatedly può essere utilizzata al massimo una volta su una expectation.

source: The With() clause allows us to match all arguments of a mock function as a whole.
it_it: La clausola With() ci consente di abbinare tutti gli argomenti di una funzione mock nel suo insieme.

source: The With clause can be used at most once on an expectation and must be the first clause.
it_it: La clausola With può essere utilizzata al massimo una volta su una expectation e deve essere la prima clausola.

source: The With clause can be used at most once with each ON_CALL statement.
it_it: La clausola With può essere utilizzata al massimo una volta su ogni istruzione ON_CALL.

source: The argument can be either a C string or a C++ string object:
it_it: argument può essere una stringa C o un oggetto stringa C++:

source: The description string is a string-typed expression that documents what the matcher does, and is used to generate the failure message when the match fails.
it_it: La description string è un'espressione di tipo string che documenta ciò che fa il matcher e viene utilizzata per generare il messaggio di errore quando la corrispondenza fallisce.

source: The factory argument is a factory callable (move-constructible) object or function pointer that creates a new instance of the Test object.
it_it: L'argomento factory è un oggetto richiamabile factory (costruibile tramite spostamento) o un puntatore a funzione che crea una nuova istanza dell'oggettoTest.

source: The file and line attributes record the source file location, where the test was defined.
it_it: Gli attributi file e line registrano la posizione del file sorgente, dove è stato definito il test.

source: The message argument can be anything streamable to std::ostream.
it_it: L'argomento message può essere qualsiasi cosa accodabile a std::ostream.

source: The selecting-an-action's-arguments recipe showed us one way to make a mock function and an action with incompatible argument lists fit together.
it_it: La ricetta selecting-an-action's-arguments ci ha mostrato un modo per far combaciare una funzione mock e un'azione con elenchi di argomenti incompatibili.

source: The statement argument of ASSERT_EXIT() can be any valid C++ statement.
it_it: L'argomento statement di ASSERT_EXIT() può essere qualsiasi istruzione C++ valida.

source: The testing::InitGoogleTest() function parses the command line for GoogleTest flags, and removes all recognized flags.
it_it: La funzione testing::InitGoogleTest() analizza la riga di comando per i flag di GoogleTest e rimuove tutti i flag riconosciuti.

source: The tests attribute of a <testsuites> or <testsuite> element tells how many test functions the GoogleTest program or test suite contains, while the failures attribute tells how many of them failed.
it_it: L'attributo tests di un elemento <testsuites> o <testsuite> indica quante funzioni di test contiene il programma GoogleTest o la test suite, mentre l'attributo failures indica quanti di essi hanno fallito.

source: The time attribute expresses the duration of the test, test suite, or entire test program in seconds.
it_it: L'attributo time esprime la durata del test, della test suite o dell'intero programma di test in secondi.

source: The timestamp attribute records the local date and time of the test execution.
it_it: L'attributo timestamp registra la data e l'ora locale dell'esecuzione del test.

source: The ::testing::AssertionResult class solves this problem.
it_it: La classe ::testing::AssertionResult risolve questo problema.

source: The MakePolymorphicAction() function template makes it easy to define such an action:
it_it: La funzione template MakePolymorphicAction() semplifica la definizione di tale azione:

source: The _P suffix is for "parameterized" or "pattern", whichever you prefer to think.
it_it: Il suffisso _P sta per "parametrizzato" o "pattern", a seconda di come si preferisce pensare.

source: The first argument is the name of the test suite, and the second argument is the test's name within the test suite.
it_it: Il primo argomento è il nome della "test suite" e il secondo argomento è il nome del test nella "test suite".

source: The last value recorded for a key will be emitted to the XML output if you specify one.
it_it: L'iltimo valore registrato per una chiave verrà emesso nell'output XML se se ne specifica uno.

source: The UnitTest object owns the string.
it_it: L'oggetto UnitTest possiede la stringa.

source: The ON_CALL specification will apply only to calls of method_name whose arguments match all of the matchers.
it_it: La specifica ON_CALL si applicherà solo alle chiamate di method_name i cui argomenti corrispondono a tutti i matcher.

source: The ::testing::InitGoogleTest method does what the name suggests—it initializes the framework and must be called before RUN_ALL_TESTS.
it_it: Il metodo ::testing::InitGoogleTest fa ciò che suggerisce il nome: inizializza il framework e deve essere chiamato prima di RUN_ALL_TESTS.

source: The ASSERT_* variants abort the program execution if an assertion fails while EXPECT_* variants continue with the run.
it_it: Le varianti ASSERT_* interrompono l'esecuzione del programma se un'asserzione fallisce mentre le varianti EXPECT_* continuano l'esecuzione.

source: The Google C++ Testing Framework has an interesting category of assertions (ASSERT_DEATH, ASSERT_EXIT, and so on) that it calls the death assertions.
it_it: Il Google C++ Testing Framework ha un'interessante categoria di asserzioni (ASSERT_DEATH, ASSERT_EXIT e così via) chiamate death assertions .

source: The Google assertion macros may throw exceptions in platforms where they are enabled in future releases.
it_it: Le macro di asserzione di Google potrebbero generare eccezioni nelle piattaforme in cui sono abilitate nelle versioni future.

source: The Google test framework comes with a whole host of predefined assertions.
it_it: Il framework di test di Google viene fornito con tutta una serie di asserzioni predefinite.

source: The GoogleTest output is meant to be a concise and human-friendly report.
it_it: L'output di GoogleTest vuole essere un rapporto conciso e di facile comprensione.

source: The GoogleTest team is considering making the assertion macros throw on platforms where exceptions are enabled (e.g. Windows, Mac OS, and Linux client-side), which will eliminate the need for the user to propagate failures from a subroutine to its caller.
it_it: Il team di GoogleTest sta valutando la possibilità di lanciare eccezioni [throw] nelle macro di asserzione su piattaforme in cui sono abilitate le eccezioni (ad esempio Windows, Mac OS e Linux lato client), il che eliminerà la necessità per l'utente di propagare gli errori da una subroutine al suo chiamante.

source: The Nice, the Strict, and the Naggy {#NiceStrictNaggy}
it_it: Nice, Strict e Naggy {#NiceStrictNaggy}

source: The [Death Tests And Threads](#death-tests-and-threads) section below explains why.
it_it: La seguente sezione [I Death Test E i Thread](#death-tests-and-threads) spiega il perché.

source: The [Undefined Behavior Sanitizer](https://clang.llvm.org/docs/UndefinedBehaviorSanitizer.html), [Address Sanitizer](https://github.com/google/sanitizers/wiki/AddressSanitizer), and [Thread Sanitizer](https://github.com/google/sanitizers/wiki/ThreadSanitizerCppManual) all provide weak functions that you can override to trigger explicit failures when they detect sanitizer errors, such as creating a reference from `nullptr`.
it_it: [Undefined Behavior Sanitizer](https://clang.llvm.org/docs/UndefinedBehaviorSanitizer.html), [Address Sanitizer](https://github.com/google/sanitizers/wiki/AddressSanitizer) e [Thread Sanitizer](https://github.com/google/sanitizers/wiki/ThreadSanitizerCppManual) forniscono tutti funzioni deboli che si possono sovrascrivere [override] per sollevare errori espliciti quando rilevano errori di sanitizer, come la creazione di un riferimento da `nullptr`.

source: The [`TestInfo`](reference/testing.md#TestInfo) class has this information.
it_it: La classe [`TestInfo`](reference/testing.md#TestInfo) contiene queste informazioni.

source: The [selecting-an-action's-arguments](#SelectingArgs) recipe showed us one way to make a mock function and an action with incompatible argument lists fit together.
it_it: La ricetta [selecting-an-action's-arguments](#SelectingArgs) ci ha mostrato un modo per far combaciare una funzione mock e un'azione con elenchi di argomenti incompatibili.

source: The `--gtest_repeat` flag allows you to repeat all (or selected) test methods in a program many times.
it_it: Il flag `--gtest_repeat` consente di ripetere più volte tutti i metodi di test (o quelli selezionati) in un programma.

source: The `::testing::AssertionResult` class solves this problem.
it_it: La classe `::testing::AssertionResult` risolve questo problema.

source: The `ACTION*` macros cannot be used inside a function or class.
it_it: Le macro `ACTION*` non possono essere utilizzate all'interno di una funzione o di una classe.

source: The `After` clause can be used any number of times on an expectation.
it_it: La clausola `After` è utilizzabile un numero qualsiasi di volte per ogni expectation.

source: The `ExpectationSet` object is helpful when the number of prerequisites for an expectation is large or variable, for example:
it_it: L'oggetto `ExpectationSet` è utile quando il numero di prerequisiti per una expectation è elevato o variabile, ad esempio:

source: The `InSequence` clause can be used any number of times on an expectation.
it_it: La clausola `InSequence` è utilizzabile un numero qualsiasi di volte in per ogni expectation.

source: The `InitGoogleTest(int* argc, wchar_t** argv)` overload can be used in Windows programs compiled in `UNICODE` mode.
it_it: L'overload `InitGoogleTest(int* argc, wchar_t** argv)` è utilizzabile nei programmi Windows compilati in modalità `UNICODE`.

source: The `MATCHER*` family of macros can be used to define custom matchers easily.
it_it: La famiglia delle macro `MATCHER*` può essere utilizzata per definire facilmente dei matcher custom.

source: The `MATCHER*` macros cannot be used inside a function or class.
it_it: Le macro `MATCHER*` non possono essere utilizzate all'interno di una funzione o di una classe.

source: The `MakePolymorphicAction()` function template makes it easy to define such an action:
it_it: La funzione template `MakePolymorphicAction()` semplifica la definizione di tale azione:

source: The `NanSensitive*` version instead treats two NaNs as equal, which is often what a user wants.
it_it: La versione `NanSensitive*` tratta invece due NaN come uguali, che spesso è ciò che un utente desidera.

source: The `ON_CALL()` macro allows you to customize your mock's behavior at the method level:
it_it: La macro `ON_CALL()` consente di personalizzare il comportamento del mock a livello del metodo:

source: The `ON_CALL` specification will apply only to calls of *`method_name`* whose arguments match all of the matchers.
it_it: La specifica `ON_CALL` si applicherà solo alle chiamate di *`method_name`* i cui argomenti corrispondono a tutti i matcher.

source: The `RetiresOnSaturation` clause can be used at most once on an expectation and must be the last clause.
it_it: La clausola `RetiresOnSaturation` può essere utilizzata al massimo una volta su una expectation e deve essere l'ultima clausola.

source: The `RetiresOnSaturation` clause is only meaningful for expectations with an upper-bounded cardinality.
it_it: La clausola `RetiresOnSaturation` è significativa solo per le expectation con una cardinalità con un limite superiore.

source: The `Return(x)` action saves a copy of `x` when the action is created, and always returns the same value whenever it's executed.
it_it: L'azione `Return(x)` salva una copia di `x` quando l'azione viene creata e restituisce sempre lo stesso valore ogni volta che viene eseguita.

source: The `SUCCEED` assertion is purely documentary and currently doesn't generate any user-visible output.
it_it: L'asserzione `SUCCEED` è puramente documentaria e attualmente non genera alcun output visibile all'utente.

source: The `ScopedTrace` constructor has the following form:
it_it: Il costruttore di `ScopedTrace` ha la seguente forma:

source: The `TEST` macros handle the vast majority of all use cases, but there are few where runtime registration logic is required.
it_it: Le macro `TEST` gestiscono la stragrande maggioranza di tutti i casi d'uso, ma ce ne sono alcuni in cui è richiesta la logica di registrazione a runtime.

source: The `Times()` clause can be omitted.
it_it: La clausola `Times()` può essere omessa.

source: The `Times` clause can be used at most once on an expectation.
it_it: La clausola `Times` può essere utilizzata al massimo una volta su una expectation.

source: The `UnitTest` object owns the string.
it_it: L'oggetto `UnitTest` possiede la stringa.

source: The `WillByDefault` clause must be used exactly once with each `ON_CALL` statement.
it_it: La clausola `WillByDefault` deve essere utilizzata esattamente una volta con ciascuna istruzione `ON_CALL`.

source: The `WillOnce` clause can be used any number of times on an expectation.
it_it: La clausola `WillOnce` è utilizzabile un numero qualsiasi di volte per ogni expectation.

source: The `WillRepeatedly` clause can be used at most once on an expectation.
it_it: La clausola `WillRepeatedly` può essere utilizzata al massimo una volta su una expectation.

source: The `With()` clause allows us to match all arguments of a mock function as a whole.
it_it: La clausola `With()` ci consente di abbinare tutti gli argomenti di una funzione mock nel suo insieme.

source: The `With` clause can be used at most once on an expectation and must be the first clause.
it_it: La clausola `With` può essere utilizzata al massimo una volta su una expectation e deve essere la prima clausola.

source: The `With` clause can be used at most once with each `ON_CALL` statement.
it_it: La clausola `With` può essere utilizzata al massimo una volta su ogni istruzione `ON_CALL`.

source: The `_P` suffix is for "parameterized" or "pattern", whichever you prefer to think.
it_it: Il suffisso `_P` sta per "parametrizzato" o "pattern", a seconda di come si preferisce pensare.

source: The `argument` can be either a C string or a C++ string object:
it_it: `argument` può essere una stringa C o un oggetto stringa C++:

source: The `factory` argument is a factory callable (move-constructible) object or function pointer that creates a new instance of the Test object.
it_it: L'argomento `factory` è un oggetto richiamabile da factory (costruibile tramite spostamento) o un puntatore a funzione che crea una nuova istanza dell'oggetto Test.

source: The `factory` argument is a factory callable (move-constructible) object or function pointer that creates a new instance of the `Test` object.
it_it: L'argomento `factory` è un oggetto richiamabile da factory (costruibile tramite spostamento) o un puntatore a funzione che crea una nuova istanza dell'oggetto `Test`.

source: The `file` and `line` attributes record the source file location, where the test was defined.
it_it: Gli attributi `file` e `line` registrano la posizione del file sorgente, dove è stato definito il test.

source: The `message` argument can be anything streamable to `std::ostream`.
it_it: L'argomento `message` può essere qualsiasi cosa accodabile a `std::ostream`.

source: The `statement` argument of `ASSERT_EXIT()` can be any valid C++ statement.
it_it: L'argomento `statement` di `ASSERT_EXIT()` può essere qualsiasi istruzione C++ valida.

source: The `testing::InitGoogleTest()` function parses the command line for GoogleTest flags, and removes all recognized flags.
it_it: La funzione `testing::InitGoogleTest()` analizza la riga di comando per i flag di GoogleTest e rimuove tutti i flag riconosciuti.

source: The `tests` attribute of a `<testsuites>` or `<testsuite>` element tells how many test functions the GoogleTest program or test suite contains, while the `failures` attribute tells how many of them failed.
it_it: L'attributo `tests` di un elemento `<testsuites>` o `<testsuite>` indica quante funzioni di test contiene il programma GoogleTest o la test suite, mentre l'attributo `failures` indica quanti di essi hanno fallito.

source: The `time` attribute expresses the duration of the test, test suite, or entire test program in seconds.
it_it: L'attributo `time` esprime la durata del test, della test suite o dell'intero programma di test in secondi.

source: The `timestamp` attribute records the local date and time of the test execution.
it_it: L'attributo `timestamp` registra la data e l'ora locale dell'esecuzione del test.

source: The above code verifies that val1 is less than, or approximately equal to, val2.
it_it: Il codice precedente controlla che val1 sia inferiore o approssimativamente uguale a val2.
